tutorials/multiphase/interDyMFoam/damBreakWithObstacle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr PCG
    {
        preconditioner
        {
            type             GAMG;
            tolerance        1e-3;
            relTol           0;

            smoother         GaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nBottomSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };

        tolerance        1e-4;
        relTol           0;
        maxIter          100;
    };

    pd GAMG
    {
        tolerance        1e-8;
        relTol           0.05;

        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;

        cacheAgglomeration false;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    pdFinal PCG
    {
        preconditioner
        {
            type             GAMG;
            tolerance        1e-8;
            relTol           0;

            nVcycles         2;

            smoother         GaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nFinestSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };

        tolerance        1e-8;
        relTol           0;
        maxIter          20;
    };

    U smoothSolver
    {
        smoother         GaussSeidel;
        tolerance        1e-6;
        relTol           0;
        nSweeps          1;
    };

    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    B PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    nuTilda PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
}

PISO
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    nGammaCorr      1;
    nGammaSubCycles 3;
    cGamma          1;

    pdRefPoint      (0.51 0.51 0.51);
    pdRefValue      0;
    pRefValue       0;
}

// ************************************************************************* //
